<template>
  <div class="flex flex-col justify-center gap-[12.8rem] mx-auto w-[96rem] pt-[12.5rem]">
    <h1 class="h1 w-[91.2rem]">
      {{ LABELS.title }}
    </h1>

    <div class="flex flex-col gap-[12.8rem]">
      <div
        v-for="(dataItem, index) in data"
        :key="dataItem.id"
        class="flex flex-col gap-gap"
      >
        <h2 class="h2">
          {{ index + 1 }}. {{ dataItem.title }}
        </h2>

        <div
          v-for="child in dataItem.children"
          :key="child.id"
          class="t1"
        >
          <p
            v-if="child.type === 'paragraph'"
            class="t1"
          >
            {{ child.value }}
          </p>

          <div
            v-if="child.type === 'list'"
            class="flex flex-col gap-gap"
          >
            <ol
              v-for="(listItem, listIndex) in child.value"
              :key="`${dataItem.id}-list-${listIndex}`"
            >
              <li class="flex gap-[.8rem]">
                <p class="shrink-0">
                  {{ listIndex + 1 }}.
                </p>

                <p class="grow">
                  {{ listItem }}
                </p>
              </li>
            </ol>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
defineOptions({
  name: 'PolicyPageWidget'
})

const LABELS = {
  title: 'Политика в отношении обработки персональных данных\n'
}

const data = computed(() => {
  return [
    {
      title: 'Общие положения',
      id: 'general',
      children: [
        {
          type: 'paragraph',
          id: 'general-paragraph',
          value: `Настоящая политика обработки персональных данных составлена
          в соответствии с требованиями Федерального закона от 27.07.2006.
          №152-ФЗ «О персональных данных» и определяет порядок обработки персональных
          данных и меры по обеспечению безопасности персональных данных ИП Мерзлов Сергей Борисович (далее – Оператор).`
        },
        {
          type: 'list',
          id: 'general-list',
          value: [
            `Оператор ставит своей важнейшей целью и условием
            осуществления своей деятельности соблюдение прав и
            свобод человека и гражданина при обработке его персональных
            данных, в том числе защиты прав на неприкосновенность частной
            жизни, личную и семейную тайну.`,

            `Настоящая политика Оператора в отношении обработки
            персональных данных (далее – Политика) применяется
            ко всей информации, которую Оператор может получить о
            посетителях веб-сайта https://uxpro.ru.`,
          ]
        }
      ]
    },

    {
      title: 'Основные понятия, используемые в Политике',
      id: 'basic',
      children: [
        {
          type: 'list',
          id: 'basic-list',
          value: [
            `Автоматизированная обработка персональных данных – обработка
            персональных данных с помощью средств вычислительной техники;`,

            `Блокирование персональных данных – временное прекращение обработки
            персональных данных (за исключением случаев, если обработка необходима
            для уточнения персональных данных);`,

            `Веб-сайт – совокупность графических и информационных материалов,
            а также программ для ЭВМ и баз данных, обеспечивающих их доступность
            в сети интернет по сетевому адресу https://uxpro.ru;`,

            `Информационная система персональных данных — совокупность содержащихся
            в базах данных персональных данных, и обеспечивающих их обработку информационных
            технологий и технических средств;`,

            `Обезличивание персональных данных — действия, в результате которых невозможно
            определить без использования дополнительной информации принадлежность персональных
            данных конкретному Пользователю или иному субъекту персональных данных;`,

            `Обработка персональных данных – любое действие (операция) или совокупность
            действий (операций), совершаемых с использованием средств автоматизации или
            без использования таких средств с персональными данными, включая сбор, запись,
            систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение,
            использование, передачу (распространение, предоставление, доступ), обезличивание,
            блокирование, удаление, уничтожение персональных данных;`,

            `Оператор – государственный орган, муниципальный орган, юридическое или физическое
            лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие
            обработку персональных данных, а также определяющие цели обработки персональных данных,
            состав персональных данных, подлежащих обработке, действия (операции), совершаемые с
            персональными данными;`,

            `Персональные данные – любая информация, относящаяся прямо или косвенно к определенному
            или определяемому Пользователю веб-сайта https://uxpro.ru;`,

            `Пользователь – любой посетитель веб-сайта https://uxpro.ru;`,

            `Предоставление персональных данных – действия, направленные на раскрытие персональных
            данных определенному лицу или определенному кругу лиц;`,

            `Распространение персональных данных – любые действия, направленные на раскрытие
            персональных данных неопределенному кругу лиц (передача персональных данных) или на
            ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование
            персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных
            сетях или предоставление доступа к персональным данным каким-либо иным способом;`,

            `Трансграничная передача персональных данных – передача персональных данных на территорию
            иностранного государства органу власти иностранного государства, иностранному физическому
            или иностранному юридическому лицу;`,

            `Уничтожение персональных данных – любые действия, в результате которых персональные данные
            уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных
            в информационной системе персональных данных и (или) результате которых уничтожаются материальные
            носители персональных данных.`,
          ]
        }
      ]
    },

    {
      title: 'Оператор может обрабатывать следующие персональные данные Пользователя',
      id: 'operator',
      children: [
        {
          type: 'list',
          id: 'operator-list',
          value: [
            `Фамилия, имя, отчество;`,

            `Электронный адрес;`,

            `Номера телефонов;`,

            `Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики (Яндекс Метрика и Гугл Аналитика и других).`,

            `Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные.`,
          ]
        }
      ]
    },

    {
      title: 'Цели обработки персональных данных',
      id: 'goals',
      children: [
        {
          type: 'list',
          id: 'goals-list',
          value: [
            `Цель обработки персональных данных Пользователя — информирование
            Пользователя посредством отправки электронных писем.`,

            `Также Оператор имеет право направлять Пользователю уведомления о новых
            продуктах и услугах, специальных предложениях и различных событиях. Пользователь
            всегда может отказаться от получения информационных сообщений, направив Оператору
            письмо на адрес электронной почты hi@uxpro.ru с пометкой «Отказ от уведомлениях о
            новых продуктах и услугах и специальных предложениях».`,

            `Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики,
            служат для сбора информации о действиях Пользователей на сайте, улучшения качества
            сайта и его содержания.`,
          ]
        }
      ]
    },

    {
      title: 'Правовые основания обработки персональных данных',
      id: 'legal-grounds',
      children: [
        {
          type: 'list',
          id: 'legal-grounds-list',
          value: [
            `Оператор обрабатывает персональные данные Пользователя
            только в случае их заполнения и/или отправки Пользователем
            самостоятельно через специальные формы, расположенные на сайте
            https://uxpro.ru. Заполняя соответствующие формы и/или отправляя
            свои персональные данные Оператору, Пользователь выражает свое
            согласие с данной Политикой.`,

            `Оператор обрабатывает обезличенные данные о Пользователе в случае, если
            это разрешено в настройках браузера Пользователя (включено сохранение файлов
            «cookie» и использование технологии JavaScript).`,
          ]
        }
      ]
    },

    {
      title: 'Порядок сбора, хранения, передачи и других видов обработки персональных данных',
      id: 'data-collection',
      children: [
        {
          type: 'paragraph',
          id: 'data-collection-paragraph',
          value: `Безопасность персональных данных, которые обрабатываются
          Оператором, обеспечивается путем реализации правовых, организационных и
          технических мер, необходимых для выполнения в полном объеме требований
          действующего законодательства в области защиты персональных данных.`
        },

        {
          type: 'list',
          id: 'data-collection-list',
          value: [
            `Оператор обеспечивает сохранность персональных данных и
            принимает все возможные меры, исключающие доступ к персональным
            данным неуполномоченных лиц.`,

            `Персональные данные Пользователя никогда, ни при каких условиях не
            будут переданы третьим лицам, за исключением случаев, связанных с
            исполнением действующего законодательства.`,

            `В случае выявления неточностей в персональных данных, Пользователь может
            актуализировать их самостоятельно, путем направления Оператору уведомление
            на адрес электронной почты Оператора hi@uxpro.ru с пометкой «Актуализация
            персональных данных».`,

            `Срок обработки персональных данных является неограниченным. Пользователь
            может в любой момент отозвать свое согласие на обработку персональных данных,
            направив Оператору уведомление посредством электронной почты на электронный
            адрес Оператора hi@uxpro.ru с пометкой «Отзыв согласия на обработку персональных данных».`,
          ]
        }
      ]
    },

    {
      title: 'Трансграничная передача персональных данных',
      id: 'cross-border-transmission-data',
      children: [
        {
          type: 'list',
          id: 'cross-border-transmission-data-list',
          value: [
            `Оператор до начала осуществления трансграничной передачи персональных
            данных обязан убедиться в том, что иностранным государством, на территорию
            которого предполагается осуществлять передачу персональных данных,
            обеспечивается надежная защита прав субъектов персональных данных.`,

            `Трансграничная передача персональных данных на территории иностранных государств,
            не отвечающих вышеуказанным требованиям, может осуществляться только в случае наличия
            согласия в письменной форме субъекта персональных данных на трансграничную передачу
            его персональных данных и/или исполнения договора, стороной которого является субъект
            персональных данных.`,
          ]
        }
      ]
    },

    {
      title: 'Заключительные положения',
      id: 'final',
      children: [
        {
          type: 'list',
          id: 'final-list',
          value: [
            `Пользователь может получить любые разъяснения по интересующим
            вопросам, касающимся обработки его персональных данных, обратившись
            к Оператору с помощью электронной почты hi@uxpro.ru.`,

            `В данном документе будут отражены любые изменения политики
            обработки персональных данных Оператором. Политика действует
            бессрочно до замены ее новой версией.`,

            `Актуальная версия Политики в свободном доступе расположена
            в сети Интернет по адресу https://uxpro.ru/policy.`,
          ]
        }
      ]
    }
  ]
})
</script>
